CSI API ETABS v1
cCaseResponseSpectrum.GetEccentricity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetEccentricity(
	string Name,
	ref double Eccen
)
Function GetEccentricity (
	Name As String,
	ByRef Eccen As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim Eccen As Double
Dim returnValue As Integer
returnValue = instance.GetEccentricity(Name,
	Eccen)
int GetEccentricity(
	String^ Name,
	double% Eccen
)
abstract GetEccentricity :
        Name : string *
        Eccen : float byref -> int
Parameters
Name
Type: System.String
Eccen
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace